// Задача з обчисленням знижки на покупку в залежності від кількості товару: Користувач вводить кількість товару та його ціну. Програма розраховує знижку відповідно до кількості товару: наприклад, якщо купується більше 10 одиниць, знижка складає 10%, якщо більше 20 - 20% і т.д.

// const quantity = prompt('Введіть кількість товару');
// const price = prompt('Введіть ціну товару');
// let discount = 0;

// if(quantity >10 && quantity <= 20){
//     discount = 0.1 //10%
// }
// else if(quantity > 20){
//     discount = 0.2 //20%
// }
// const totalPrice = quantity * price;
// const disPrice = totalPrice * (1 - discount)
// console.log(totalPrice, disPrice)


// Задача з обчисленням кількості товару, яку можна купити за обмежений бюджет: Користувач вводить суму грошей у гаманці та ціну товару. Програма обчислює максимальну кількість товару, яку можна купити за цю суму.

// const budget = prompt('Введіть суму грошей у гаманці')
// const itemPrice = prompt('Введіть ціну товару')
// const sum = Math.floor(budget / itemPrice)

// console.log(sum)


// Задача з обчисленням вартості покупки з урахуванням податку: Користувач вводить вартість товару та ставку податку. Програма розраховує загальну вартість покупки з урахуванням податку. Задача з обчисленням периметра та площі прямокутника: Користувач вводить довжину та ширину прямокутника. Програма обчислює його периметр та площу.
// const price1 = prompt('Введіть ціну товару')
// const rate = prompt('Введіть ставку податку у відсотках')

// const totalPrice1 = price1 * (1 + rate / 100)
// console.log(totalPrice1)


// // Задача з обчисленням середньої швидкості: Користувач вводить відстань та час подорожі. Програма розраховує середню швидкість, яку потрібно розвивати, щоб подорожувати з заданою відстанню за заданий час.

// let distance = +prompt('Введіть відстань')
// let time = +prompt('Введіть час подорожі')

// let speed = distance / time;
// console.log(`Вам необхідно рухатися зі швидкістю ${speed} км/год`)


const month = +prompt('Напишить номер місяця')
let days = 0 
if (month >= 1 && month <=12){
    if(month === 1 || month === 3 || month === 5 || month === 7 || month === 8 || month === 12 || month === 10){
        days = 31
        
    }else if(month === 4 || month === 6 || month === 11){
        days = 30
    }else{
        days = 28
        console.log(days+'Якщо високосний рік тоді може бути 29')
    }
    console.log(days)
}
