// Сума двох чисел:
// Запросіть у користувача введення двох чисел, додайте їх та виведіть результат.

let number1 = +prompt('Введіть перше число')
let number2 = +prompt('Введіть друге число')

let sum = number1 + number2;
console.log(`Сума чисел ${sum}`)


// Обчислення площі прямокутника:
// Запитайте у користувача довжину та ширину прямокутника, а потім обчисліть та виведіть площу прямокутника.

let length = +prompt('Введіть довжину прямокутника')
let width = +prompt('Введіть ширину прямокутника')

let area = length * width;
console.log(`Площа прямокутника ${area}`)


// Оцінка вартості доставки:
// Користувач вводить відстань до місця доставки та бажаний час доставки. Програма повинна розрахувати вартість доставки, враховуючи стандартну ставку за км та можливі додаткові тарифи за терміновість доставки.

let distance = +prompt('Введіть відстань до місця доставки')
let time = +prompt('Введіть бажаний час доставки')

const standarttariff = 5;

if (time <= 1) {
    tariff = 50; 
} 
else if (time <= 3) {
    tariff = 30; 
} 
else if (time <= 5) {
    tariff = 20; 
}

let cost = (distance * standarttariff) + tariff;
console.log(`Вартість доставки ${cost}`)